{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "."
    },
    "behavior": "Isolated",
    "invert": true
  },
  "post_processor": null,
  "decoder": {
    "type": "BPEDecoder",
    "suffix": " "
  },
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[PAD]": 0,
      "[BOS]": 1,
      "[EOS]": 2,
      "[UNK]": 3,
      "a": 4,
      "b": 5,
      "c": 6,
      "d": 7,
      "e": 8,
      "f": 9,
      "g": 10,
      "h": 11,
      "i": 12,
      "j": 13,
      "k": 14,
      "l": 15,
      "m": 16,
      "n": 17,
      "o": 18,
      "p": 19,
      "q": 20,
      "r": 21,
      "s": 22,
      "t": 23,
      "u": 24,
      "v": 25,
      "w": 26,
      "x": 27,
      "y": 28,
      "z": 29,
      "A": 30,
      "B": 31,
      "C": 32,
      "D": 33,
      "E": 34,
      "F": 35,
      "G": 36,
      "H": 37,
      "I": 38,
      "J": 39,
      "K": 40,
      "L": 41,
      "M": 42,
      "N": 43,
      "O": 44,
      "P": 45,
      "Q": 46,
      "R": 47,
      "S": 48,
      "T": 49,
      "U": 50,
      "V": 51,
      "W": 52,
      "X": 53,
      "Y": 54,
      "Z": 55,
      "0": 56,
      "1": 57,
      "2": 58,
      "3": 59,
      "4": 60,
      "5": 61,
      "6": 62,
      "7": 63,
      "8": 64,
      "9": 65,
      "!": 66,
      "?": 67,
      ":": 68,
      "|": 69,
      "тСа": 70,
      "тСб": 71,
      "тСв": 72,
      "тСг": 73,
      "тСд": 74,
      "тСе": 75,
      "тСж": 76,
      "тСз": 77,
      "тСи": 78,
      "тСй": 79,
      "тСк": 80,
      "тСл": 81,
      "тСм": 82,
      "тСн": 83,
      "тСо": 84,
      "тСп": 85,
      "тС░": 86,
      "тС▒": 87,
      "тС▓": 88,
      "тС│": 89,
      "тТ╢": 90,
      "тТ╖": 91,
      "тТ╕": 92,
      "тТ╣": 93,
      "тТ║": 94,
      "тТ╗": 95,
      "тТ╝": 96,
      "тТ╜": 97,
      "тТ╛": 98,
      "тТ┐": 99,
      "тУА": 100,
      "тУБ": 101,
      "тУВ": 102,
      "тУГ": 103,
      "тУД": 104,
      "тУЕ": 105,
      "тУЖ": 106,
      "тУЗ": 107,
      "тУИ": 108,
      "тУЙ": 109,
      "тУК": 110,
      "тУЛ": 111,
      "тУМ": 112,
      "тУН": 113,
      "тУО": 114,
      "тУП": 115,
      "тУР": 116,
      "тУС": 117,
      "тУТ": 118,
      "тУУ": 119,
      "тУФ": 120,
      "тУХ": 121,
      "тУЦ": 122,
      "тУЧ": 123,
      "тУШ": 124,
      "тУЩ": 125,
      "тУЪ": 126,
      "тУЫ": 127,
      "тУЬ": 128,
      "тУЭ": 129,
      "тУЮ": 130,
      "тУЯ": 131,
      "тУа": 132,
      "тУб": 133,
      "тУв": 134,
      "тУг": 135,
      "тУд": 136,
      "тУе": 137,
      "тУж": 138,
      "тУз": 139,
      "тУи": 140,
      "тУй": 141,
      "тУк": 142,
      "тУл": 143,
      "тУм": 144,
      "тУн": 145,
      "тУо": 146,
      "тУп": 147,
      "тУ░": 148,
      "тУ▒": 149,
      "тУ▓": 150,
      "тУ│": 151,
      "тУ┤": 152,
      "ЁЯША": 153,
      "ЁЯШБ": 154,
      "ЁЯШВ": 155,
      "ЁЯШГ": 156,
      "ЁЯШД": 157,
      "ЁЯШЕ": 158,
      "ЁЯШЖ": 159,
      "ЁЯШЗ": 160,
      "ЁЯШИ": 161,
      "ЁЯШЙ": 162,
      "ЁЯШК": 163,
      "ЁЯШЛ": 164,
      "ЁЯШМ": 165,
      "ЁЯШН": 166,
      "ЁЯШО": 167,
      "ЁЯШП": 168,
      "ЁЯШР": 169,
      "ЁЯШС": 170,
      "ЁЯШТ": 171,
      "ЁЯШУ": 172,
      "ЁЯШФ": 173,
      "ЁЯШХ": 174,
      "ЁЯШЦ": 175,
      "ЁЯШЧ": 176,
      "ЁЯШШ": 177,
      "ЁЯШЩ": 178,
      "ЁЯШЪ": 179,
      "ЁЯШЫ": 180,
      "ЁЯШЬ": 181,
      "ЁЯШЭ": 182,
      "ЁЯШЮ": 183,
      "ЁЯШЯ": 184,
      "ЁЯШа": 185,
      "ЁЯШб": 186,
      "ЁЯШв": 187,
      "ЁЯШг": 188,
      "ЁЯШд": 189,
      "ЁЯШе": 190,
      "ЁЯШж": 191,
      "ЁЯШз": 192,
      "ЁЯШи": 193,
      "ЁЯШй": 194,
      "ЁЯШк": 195,
      "ЁЯШл": 196,
      "ЁЯШм": 197,
      "ЁЯШн": 198,
      "ЁЯШо": 199,
      "ЁЯШп": 200,
      "ЁЯШ░": 201,
      "ЁЯШ▒": 202,
      "ЁЯШ▓": 203,
      "ЁЯШ│": 204,
      "ЁЯШ┤": 205,
      "ЁЯШ╡": 206,
      "ЁЯШ╢": 207,
      "ЁЯШ╖": 208,
      "ЁЯШ╕": 209,
      "ЁЯШ╣": 210,
      "ЁЯШ║": 211,
      "ЁЯШ╗": 212,
      "ЁЯШ╝": 213,
      "ЁЯШ╜": 214,
      "ЁЯШ╛": 215,
      "ЁЯШ┐": 216,
      "ЁЯЩА": 217,
      "ЁЯЩБ": 218,
      "ЁЯЩВ": 219,
      "ЁЯЩГ": 220,
      "ЁЯЩД": 221,
      "ЁЯЩЕ": 222,
      "ЁЯЩЖ": 223,
      "ЁЯЩЗ": 224,
      "ЁЯЩИ": 225,
      "ЁЯЩЙ": 226,
      "ЁЯЩК": 227,
      "ЁЯЩЛ": 228,
      "ЁЯЩМ": 229,
      "ЁЯЩН": 230,
      "ЁЯЩО": 231,
      "ЁЯЩП": 232,
      "╬С": 233,
      "╬Т": 234,
      "╬У": 235,
      "╬Ф": 236,
      "╬Х": 237,
      "╬Ц": 238,
      "╬Ч": 239,
      "╬Ш": 240,
      "╬Щ": 241,
      "╬Ъ": 242,
      "╬Ы": 243,
      "╬Ь": 244,
      "╬Э": 245,
      "╬Ю": 246,
      "╬Я": 247,
      "╬а": 248,
      "╬б": 249,
      "╬г": 250,
      "╬д": 251,
      "╬е": 252,
      "╬ж": 253,
      "╬з": 254,
      "╬и": 255,
      "╬й": 256,
      "╬▒": 257,
      "╬▓": 258,
      "╬│": 259,
      "╬┤": 260,
      "╬╡": 261,
      "╬╢": 262,
      "╬╖": 263,
      "╬╕": 264,
      "╬╣": 265,
      "╬║": 266,
      "╬╗": 267,
      "╬╝": 268,
      "╬╜": 269,
      "╬╛": 270,
      "╬┐": 271,
      "╧А": 272,
      "╧Б": 273,
      "╧В": 274,
      "╧Г": 275,
      "╧Д": 276,
      "╧Е": 277,
      "╧Ж": 278,
      "╧З": 279,
      "╧И": 280,
      "╧Й": 281,
      "╨Р": 282,
      "╨С": 283,
      "╨Т": 284,
      "╨У": 285,
      "╨Ф": 286,
      "╨Х": 287,
      "╨Ц": 288,
      "╨Ч": 289,
      "╨Ш": 290,
      "╨Щ": 291,
      "╨Ъ": 292,
      "╨Ы": 293,
      "╨Ь": 294,
      "╨Э": 295,
      "╨Ю": 296,
      "╨Я": 297,
      "╨а": 298,
      "╨б": 299,
      "╨в": 300,
      "╨г": 301,
      "╨д": 302,
      "╨е": 303,
      "╨ж": 304,
      "╨з": 305,
      "╨и": 306,
      "╨й": 307,
      "╨к": 308,
      "╨л": 309,
      "╨м": 310,
      "╨н": 311,
      "╨о": 312,
      "╨п": 313,
      "╨░": 314,
      "╨▒": 315,
      "╨▓": 316,
      "╨│": 317,
      "╨┤": 318,
      "╨╡": 319,
      "╨╢": 320,
      "╨╖": 321,
      "╨╕": 322,
      "╨╣": 323,
      "╨║": 324,
      "╨╗": 325,
      "╨╝": 326,
      "╨╜": 327,
      "╨╛": 328,
      "╨┐": 329,
      "╤А": 330,
      "╤Б": 331,
      "╤В": 332,
      "╤Г": 333,
      "╤Д": 334,
      "╤Е": 335,
      "╤Ж": 336,
      "╤З": 337,
      "╤И": 338,
      "╤Й": 339,
      "╤К": 340,
      "╤Л": 341,
      "╤М": 342,
      "╤Н": 343,
      "╤О": 344,
      "╤П": 345,
      "┬б": 346,
      "┬в": 347,
      "┬г": 348,
      "┬д": 349,
      "┬е": 350,
      "┬ж": 351,
      "┬з": 352,
      "┬и": 353,
      "┬й": 354,
      "┬к": 355,
      "┬л": 356,
      "┬м": 357,
      "┬о": 358,
      "┬п": 359,
      "┬░": 360,
      "┬▒": 361,
      "┬▓": 362,
      "┬│": 363,
      "┬┤": 364,
      "┬╡": 365,
      "┬╢": 366,
      "┬╖": 367,
      "┬╕": 368,
      "┬╣": 369,
      "┬║": 370,
      "┬╗": 371,
      "┬╝": 372,
      "┬╜": 373,
      "┬╛": 374,
      "┬┐": 375,
      "├А": 376,
      "├Б": 377,
      "├В": 378,
      "├Г": 379,
      "├Д": 380,
      "├Е": 381,
      "├Ж": 382,
      "├З": 383,
      "├И": 384,
      "├Й": 385,
      "├К": 386,
      "├Л": 387,
      "├М": 388,
      "├Н": 389,
      "├О": 390,
      "├П": 391,
      "├Р": 392,
      "├С": 393,
      "├Т": 394,
      "├У": 395,
      "├Ф": 396,
      "├Х": 397,
      "├Ц": 398,
      "├Ч": 399,
      "├Ш": 400,
      "├Щ": 401,
      "├Ъ": 402,
      "├Ы": 403,
      "├Ь": 404,
      "├Э": 405,
      "├Ю": 406,
      "├Я": 407,
      "├а": 408,
      "├б": 409,
      "├в": 410,
      "├г": 411,
      "├д": 412,
      "├е": 413,
      "├ж": 414,
      "├з": 415,
      "├и": 416,
      "├й": 417,
      "├к": 418,
      "├л": 419,
      "├м": 420,
      "├н": 421,
      "├о": 422,
      "├п": 423,
      "├░": 424,
      "├▒": 425,
      "├▓": 426,
      "├│": 427,
      "├┤": 428,
      "├╡": 429,
      "├╢": 430,
      "├╖": 431,
      "├╕": 432,
      "├╣": 433,
      "├║": 434,
      "├╗": 435,
      "├╝": 436,
      "├╜": 437,
      "├╛": 438,
      "├┐": 439,
      "тЦа": 440,
      "тЦб": 441,
      "тЦв": 442,
      "тЦг": 443,
      "тЦд": 444,
      "тЦе": 445,
      "тЦж": 446,
      "тЦз": 447,
      "тЦи": 448,
      "тЦй": 449,
      "тЦк": 450,
      "тЦл": 451,
      "тЦм": 452,
      "тЦн": 453,
      "тЦо": 454,
      "тЦп": 455,
      "тЦ░": 456,
      "тЦ▒": 457,
      "тЦ▓": 458,
      "тЦ│": 459,
      "тЦ┤": 460,
      "тЦ╡": 461,
      "тЦ╢": 462,
      "тЦ╖": 463,
      "тЦ╕": 464,
      "тЦ╣": 465,
      "тЦ║": 466,
      "тЦ╗": 467,
      "тЦ╝": 468,
      "тЦ╜": 469,
      "тЦ╛": 470,
      "тЦ┐": 471,
      "тЧА": 472,
      "тЧБ": 473,
      "тЧВ": 474,
      "тЧГ": 475,
      "тЧД": 476,
      "тЧЕ": 477,
      "тЧЖ": 478,
      "тЧЗ": 479,
      "тЧИ": 480,
      "тЧЙ": 481,
      "тЧК": 482,
      "тЧЛ": 483,
      "тЧМ": 484,
      "тЧН": 485,
      "тЧО": 486,
      "тЧП": 487,
      "тЧР": 488,
      "тЧС": 489,
      "тЧТ": 490,
      "тЧУ": 491,
      "тЧФ": 492,
      "тЧХ": 493,
      "тЧЦ": 494,
      "тЧЧ": 495,
      "тЧШ": 496,
      "тЧЩ": 497,
      "тЧЪ": 498,
      "тЧЫ": 499,
      "тЧЬ": 500,
      "тЧЭ": 501,
      "тЧЮ": 502,
      "тЧЯ": 503,
      "тЧа": 504,
      "тЧб": 505,
      "тЧв": 506,
      "тЧг": 507,
      "тЧд": 508,
      "тЧе": 509,
      "тЧж": 510,
      "тЧз": 511,
      "тЧи": 512,
      "тЧй": 513,
      "тЧк": 514,
      "тЧл": 515,
      "тЧм": 516,
      "тЧн": 517,
      "тЧо": 518,
      "тЧп": 519
    },
    "unk_token": "[UNK]"
  }
}