{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "."
    },
    "behavior": "Isolated",
    "invert": true
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[PAD]": 0,
      "[BOS]": 1,
      "[EOS]": 2,
      "[UNK]": 3,
      "a": 4,
      "b": 5,
      "c": 6,
      "d": 7,
      "e": 8,
      "f": 9,
      "g": 10,
      "h": 11,
      "i": 12,
      "j": 13,
      "k": 14,
      "l": 15,
      "m": 16,
      "n": 17,
      "o": 18,
      "p": 19,
      "q": 20,
      "r": 21,
      "s": 22,
      "t": 23,
      "u": 24,
      "v": 25,
      "w": 26,
      "x": 27,
      "y": 28,
      "z": 29,
      "A": 30,
      "B": 31,
      "C": 32,
      "D": 33,
      "E": 34,
      "F": 35,
      "G": 36,
      "H": 37,
      "I": 38,
      "J": 39,
      "K": 40,
      "L": 41,
      "M": 42,
      "N": 43,
      "O": 44,
      "P": 45,
      "Q": 46,
      "R": 47,
      "S": 48,
      "T": 49,
      "U": 50,
      "V": 51,
      "W": 52,
      "X": 53,
      "Y": 54,
      "Z": 55,
      "0": 56,
      "1": 57,
      "2": 58,
      "3": 59,
      "4": 60,
      "5": 61,
      "6": 62,
      "7": 63,
      "8": 64,
      "9": 65,
      "!": 66,
      "?": 67,
      ":": 68,
      "|": 69,
      "в‘ ": 70,
      "в‘Ў": 71,
      "в‘ў": 72,
      "в‘Ј": 73,
      "в‘Ө": 74,
      "в‘Ҙ": 75,
      "в‘Ұ": 76,
      "в‘§": 77,
      "в‘Ё": 78,
      "в‘©": 79,
      "в‘Ә": 80,
      "в‘«": 81,
      "в‘¬": 82,
      "в‘ӯ": 83,
      "в‘®": 84,
      "в‘Ҝ": 85,
      "в‘°": 86,
      "в‘ұ": 87,
      "в‘І": 88,
      "в‘і": 89,
      "в’¶": 90,
      "в’·": 91,
      "в’ё": 92,
      "в’№": 93,
      "в’ә": 94,
      "в’»": 95,
      "в’ј": 96,
      "в’Ҫ": 97,
      "в’ҫ": 98,
      "в’ҝ": 99,
      "в“Җ": 100,
      "в“Ғ": 101,
      "в“Ӯ": 102,
      "в“ғ": 103,
      "в“„": 104,
      "в“…": 105,
      "в“Ҷ": 106,
      "в“Ү": 107,
      "в“Ҳ": 108,
      "в“ү": 109,
      "в“Ҡ": 110,
      "в“Ӣ": 111,
      "в“Ң": 112,
      "в“Қ": 113,
      "в“Һ": 114,
      "в“Ҹ": 115,
      "в“җ": 116,
      "в“‘": 117,
      "в“’": 118,
      "в““": 119,
      "в“”": 120,
      "в“•": 121,
      "в“–": 122,
      "в“—": 123,
      "в“ҳ": 124,
      "в“ҷ": 125,
      "в“ҡ": 126,
      "в“ӣ": 127,
      "в“ң": 128,
      "в“қ": 129,
      "в“һ": 130,
      "в“ҹ": 131,
      "в“ ": 132,
      "в“Ў": 133,
      "в“ў": 134,
      "в“Ј": 135,
      "в“Ө": 136,
      "в“Ҙ": 137,
      "в“Ұ": 138,
      "в“§": 139,
      "в“Ё": 140,
      "в“©": 141,
      "в“Ә": 142,
      "в“«": 143,
      "в“¬": 144,
      "в“ӯ": 145,
      "в“®": 146,
      "в“Ҝ": 147,
      "в“°": 148,
      "в“ұ": 149,
      "в“І": 150,
      "в“і": 151,
      "в“ҙ": 152,
      "рҹҳҖ": 153,
      "рҹҳҒ": 154,
      "рҹҳӮ": 155,
      "рҹҳғ": 156,
      "рҹҳ„": 157,
      "рҹҳ…": 158,
      "рҹҳҶ": 159,
      "рҹҳҮ": 160,
      "рҹҳҲ": 161,
      "рҹҳү": 162,
      "рҹҳҠ": 163,
      "рҹҳӢ": 164,
      "рҹҳҢ": 165,
      "рҹҳҚ": 166,
      "рҹҳҺ": 167,
      "рҹҳҸ": 168,
      "рҹҳҗ": 169,
      "рҹҳ‘": 170,
      "рҹҳ’": 171,
      "рҹҳ“": 172,
      "рҹҳ”": 173,
      "рҹҳ•": 174,
      "рҹҳ–": 175,
      "рҹҳ—": 176,
      "рҹҳҳ": 177,
      "рҹҳҷ": 178,
      "рҹҳҡ": 179,
      "рҹҳӣ": 180,
      "рҹҳң": 181,
      "рҹҳқ": 182,
      "рҹҳһ": 183,
      "рҹҳҹ": 184,
      "рҹҳ ": 185,
      "рҹҳЎ": 186,
      "рҹҳў": 187,
      "рҹҳЈ": 188,
      "рҹҳӨ": 189,
      "рҹҳҘ": 190,
      "рҹҳҰ": 191,
      "рҹҳ§": 192,
      "рҹҳЁ": 193,
      "рҹҳ©": 194,
      "рҹҳӘ": 195,
      "рҹҳ«": 196,
      "рҹҳ¬": 197,
      "рҹҳӯ": 198,
      "рҹҳ®": 199,
      "рҹҳҜ": 200,
      "рҹҳ°": 201,
      "рҹҳұ": 202,
      "рҹҳІ": 203,
      "рҹҳі": 204,
      "рҹҳҙ": 205,
      "рҹҳө": 206,
      "рҹҳ¶": 207,
      "рҹҳ·": 208,
      "рҹҳё": 209,
      "рҹҳ№": 210,
      "рҹҳә": 211,
      "рҹҳ»": 212,
      "рҹҳј": 213,
      "рҹҳҪ": 214,
      "рҹҳҫ": 215,
      "рҹҳҝ": 216,
      "рҹҷҖ": 217,
      "рҹҷҒ": 218,
      "рҹҷӮ": 219,
      "рҹҷғ": 220,
      "рҹҷ„": 221,
      "рҹҷ…": 222,
      "рҹҷҶ": 223,
      "рҹҷҮ": 224,
      "рҹҷҲ": 225,
      "рҹҷү": 226,
      "рҹҷҠ": 227,
      "рҹҷӢ": 228,
      "рҹҷҢ": 229,
      "рҹҷҚ": 230,
      "рҹҷҺ": 231,
      "рҹҷҸ": 232,
      "О‘": 233,
      "О’": 234,
      "О“": 235,
      "О”": 236,
      "О•": 237,
      "О–": 238,
      "О—": 239,
      "Оҳ": 240,
      "Оҷ": 241,
      "Оҡ": 242,
      "Оӣ": 243,
      "Оң": 244,
      "Оқ": 245,
      "Оһ": 246,
      "Оҹ": 247,
      "О ": 248,
      "ОЎ": 249,
      "ОЈ": 250,
      "ОӨ": 251,
      "ОҘ": 252,
      "ОҰ": 253,
      "О§": 254,
      "ОЁ": 255,
      "О©": 256,
      "Оұ": 257,
      "ОІ": 258,
      "Оі": 259,
      "Оҙ": 260,
      "Оө": 261,
      "О¶": 262,
      "О·": 263,
      "Оё": 264,
      "О№": 265,
      "Оә": 266,
      "О»": 267,
      "Ој": 268,
      "ОҪ": 269,
      "Оҫ": 270,
      "Оҝ": 271,
      "ПҖ": 272,
      "ПҒ": 273,
      "ПӮ": 274,
      "Пғ": 275,
      "П„": 276,
      "П…": 277,
      "ПҶ": 278,
      "ПҮ": 279,
      "ПҲ": 280,
      "Пү": 281,
      "Рҗ": 282,
      "Р‘": 283,
      "Р’": 284,
      "Р“": 285,
      "Р”": 286,
      "Р•": 287,
      "Р–": 288,
      "Р—": 289,
      "Рҳ": 290,
      "Рҷ": 291,
      "Рҡ": 292,
      "Рӣ": 293,
      "Рң": 294,
      "Рқ": 295,
      "Рһ": 296,
      "Рҹ": 297,
      "Р ": 298,
      "РЎ": 299,
      "Рў": 300,
      "РЈ": 301,
      "РӨ": 302,
      "РҘ": 303,
      "РҰ": 304,
      "Р§": 305,
      "РЁ": 306,
      "Р©": 307,
      "РӘ": 308,
      "Р«": 309,
      "Р¬": 310,
      "Рӯ": 311,
      "Р®": 312,
      "РҜ": 313,
      "Р°": 314,
      "Рұ": 315,
      "РІ": 316,
      "Рі": 317,
      "Рҙ": 318,
      "Рө": 319,
      "Р¶": 320,
      "Р·": 321,
      "Рё": 322,
      "Р№": 323,
      "Рә": 324,
      "Р»": 325,
      "Рј": 326,
      "РҪ": 327,
      "Рҫ": 328,
      "Рҝ": 329,
      "СҖ": 330,
      "СҒ": 331,
      "СӮ": 332,
      "Сғ": 333,
      "С„": 334,
      "С…": 335,
      "СҶ": 336,
      "СҮ": 337,
      "СҲ": 338,
      "Сү": 339,
      "СҠ": 340,
      "СӢ": 341,
      "СҢ": 342,
      "СҚ": 343,
      "СҺ": 344,
      "СҸ": 345,
      "ВЎ": 346,
      "Вў": 347,
      "ВЈ": 348,
      "ВӨ": 349,
      "ВҘ": 350,
      "ВҰ": 351,
      "В§": 352,
      "ВЁ": 353,
      "В©": 354,
      "ВӘ": 355,
      "В«": 356,
      "В¬": 357,
      "В®": 358,
      "ВҜ": 359,
      "В°": 360,
      "Вұ": 361,
      "ВІ": 362,
      "Ві": 363,
      "Вҙ": 364,
      "Вө": 365,
      "В¶": 366,
      "В·": 367,
      "Вё": 368,
      "В№": 369,
      "Вә": 370,
      "В»": 371,
      "Вј": 372,
      "ВҪ": 373,
      "Вҫ": 374,
      "Вҝ": 375,
      "ГҖ": 376,
      "ГҒ": 377,
      "ГӮ": 378,
      "Гғ": 379,
      "Г„": 380,
      "Г…": 381,
      "ГҶ": 382,
      "ГҮ": 383,
      "ГҲ": 384,
      "Гү": 385,
      "ГҠ": 386,
      "ГӢ": 387,
      "ГҢ": 388,
      "ГҚ": 389,
      "ГҺ": 390,
      "ГҸ": 391,
      "Гҗ": 392,
      "Г‘": 393,
      "Г’": 394,
      "Г“": 395,
      "Г”": 396,
      "Г•": 397,
      "Г–": 398,
      "Г—": 399,
      "Гҳ": 400,
      "Гҷ": 401,
      "Гҡ": 402,
      "Гӣ": 403,
      "Гң": 404,
      "Гқ": 405,
      "Гһ": 406,
      "Гҹ": 407,
      "Г ": 408,
      "ГЎ": 409,
      "Гў": 410,
      "ГЈ": 411,
      "ГӨ": 412,
      "ГҘ": 413,
      "ГҰ": 414,
      "Г§": 415,
      "ГЁ": 416,
      "Г©": 417,
      "ГӘ": 418,
      "Г«": 419,
      "Г¬": 420,
      "Гӯ": 421,
      "Г®": 422,
      "ГҜ": 423,
      "Г°": 424,
      "Гұ": 425,
      "ГІ": 426,
      "Гі": 427,
      "Гҙ": 428,
      "Гө": 429,
      "Г¶": 430,
      "Г·": 431,
      "Гё": 432,
      "Г№": 433,
      "Гә": 434,
      "Г»": 435,
      "Гј": 436,
      "ГҪ": 437,
      "Гҫ": 438,
      "Гҝ": 439,
      "в– ": 440,
      "в–Ў": 441,
      "в–ў": 442,
      "в–Ј": 443,
      "в–Ө": 444,
      "в–Ҙ": 445,
      "в–Ұ": 446,
      "в–§": 447,
      "в–Ё": 448,
      "в–©": 449,
      "в–Ә": 450,
      "в–«": 451,
      "в–¬": 452,
      "в–ӯ": 453,
      "в–®": 454,
      "в–Ҝ": 455,
      "в–°": 456,
      "в–ұ": 457,
      "в–І": 458,
      "в–і": 459,
      "в–ҙ": 460,
      "в–ө": 461,
      "в–¶": 462,
      "в–·": 463,
      "в–ё": 464,
      "в–№": 465,
      "в–ә": 466,
      "в–»": 467,
      "в–ј": 468,
      "в–Ҫ": 469,
      "в–ҫ": 470,
      "в–ҝ": 471,
      "в—Җ": 472,
      "в—Ғ": 473,
      "в—Ӯ": 474,
      "в—ғ": 475,
      "в—„": 476,
      "в—…": 477,
      "в—Ҷ": 478,
      "в—Ү": 479,
      "в—Ҳ": 480,
      "в—ү": 481,
      "в—Ҡ": 482,
      "в—Ӣ": 483,
      "в—Ң": 484,
      "в—Қ": 485,
      "в—Һ": 486,
      "в—Ҹ": 487,
      "в—җ": 488,
      "в—‘": 489,
      "в—’": 490,
      "в—“": 491,
      "в—”": 492,
      "в—•": 493,
      "в—–": 494,
      "в——": 495,
      "в—ҳ": 496,
      "в—ҷ": 497,
      "в—ҡ": 498,
      "в—ӣ": 499,
      "в—ң": 500,
      "в—қ": 501,
      "в—һ": 502,
      "в—ҹ": 503,
      "в— ": 504,
      "в—Ў": 505,
      "в—ў": 506,
      "в—Ј": 507,
      "в—Ө": 508,
      "в—Ҙ": 509,
      "в—Ұ": 510,
      "в—§": 511,
      "в—Ё": 512,
      "в—©": 513,
      "в—Ә": 514,
      "в—«": 515,
      "в—¬": 516,
      "в—ӯ": 517,
      "в—®": 518,
      "в—Ҝ": 519
    },
    "unk_token": "[UNK]"
  }
}